
# Reading Data with Pandas

In this Jupyter notebook, we will learn how to read data from different file formats using Pandas. We will cover:
- Reading data from a CSV file.
- Reading data from an Excel file.

In [1]:
## You can use Jupyter's code cells as a command terminal by prefixing your command with "!". Let us install Pandas using pip:
!pip install pandas

[notice] A new release of pip is available: 24.0 -> 24.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting pandas
  Downloading pandas-2.2.2-cp311-cp311-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.23.2 (from pandas)
  Downloading numpy-2.0.0-cp311-cp311-win_amd64.whl.metadata (60 kB)
     ---------------------------------------- 0.0/60.9 kB ? eta -:--:--
     ------ --------------------------------- 10.2/60.9 kB ? eta -:--:--
     ------------------- ------------------ 30.7/60.9 kB 435.7 kB/s eta 0:00:01
     ------------------------- ------------ 41.0/60.9 kB 393.8 kB/s eta 0:00:01
     -------------------------------------- 60.9/60.9 kB 460.5 kB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lapto\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\lapto\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.1/11.6 MB 1.9 MB/s eta 0:00:07
   ---------------------------------------- 0.1/11.6 MB 2.2 MB/s eta 0:00:06
    --------------------------------------- 0.2/11.6 MB 1.4 MB/s eta 0:00:09
   - -------------------------------------- 0.3/11.6 MB 2.0 MB/s eta 0:00:06
   - -------------------------------------- 0.4/11.6 MB 2.1 MB/s eta 0:00:06
   -- ------------------------------------- 0.7/11.6 MB 3.0 MB/s eta 0:00:04
   --- ------------------------------------ 0.9/11.6 MB 3.1 MB/s eta 0:00:04
   ----- ---------------------------------- 1.5/11.6 MB 4.4 MB/s eta 0:00:03
   ----- ---------------------------------- 1.7/11.6 MB 4.4 MB/s eta 0:00:03
   ------- -------------------------------- 2.1/11.6 MB 5.0 MB/s eta 0:00:02
   ----------- ---------------------------- 3.5/11.6 MB 7.3 MB/s eta 0:00:02
   --------------- ------------------------ 4.4/11.6 MB 8.3 MB/s eta 0:00:01
   ------------------ --------------------- 5.3/11.6 MB 9.4 MB/s eta 0:00:01
   ----------------------- ---------------- 6.8/11.6 MB 11.1 MB/s eta 0:00:01
   ------------------------- -------------- 7.4/11.6 MB 11.1 MB/s eta 0:00:01
   ---------------------------- ----------- 8.2/11.6 MB 11.9 MB/s eta 0:00:01
   -------------------------------- ------- 9.3/11.6 MB 12.4 MB/s eta 0:00:01
   ----------------------------------- ---- 10.3/11.6 MB 13.1 MB/s eta 0:00:01
   -------------------------------------- - 11.1/11.6 MB 18.7 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 19.2 MB/s eta 0:00:00
Downloading numpy-2.0.0-cp311-cp311-win_amd64.whl (16.5 MB)
   ---------------------------------------- 0.0/16.5 MB ? eta -:--:--
   ---- ----------------------------------- 1.9/16.5 MB 40.5 MB/s eta 0:00:01
   ------ --------------------------------- 2.7/16.5 MB 57.5 MB/s eta 0:00:01
   --------- ------------------------------ 3.7/16.5 MB 26.4 MB/s eta 0:00:01
   ----------- ---------------------------- 4.9/16.5 MB 28.3 MB/s eta 0:00:01
   ------------ --------------------------- 5.2/16.5 MB 22.1 MB/s eta 0:00:01
   -------------- ------------------------- 6.1/16.5 MB 24.3 MB/s eta 0:00:01
   ---------------- ----------------------- 6.8/16.5 MB 21.8 MB/s eta 0:00:01
   --------------------- ------------------ 9.0/16.5 MB 25.1 MB/s eta 0:00:01
   ------------------------ --------------- 10.0/16.5 MB 24.7 MB/s eta 0:00:01
   --------------------------- ------------ 11.6/16.5 MB 23.4 MB/s eta 0:00:01
   ------------------------------- -------- 12.9/16.5 MB 23.4 MB/s eta 0:00:01
   ---------------------------------- ----- 14.1/16.5 MB 25.2 MB/s eta 0:00:01
   ----------------------------------- ---- 14.8/16.5 MB 25.1 MB/s eta 0:00:01
   ---------------------------------------  16.5/16.5 MB 28.5 MB/s eta 0:00:01
   ---------------------------------------- 16.5/16.5 MB 27.3 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   --------------------------------------- 505.5/505.5 kB 16.0 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   ---------------------------------------- 345.4/345.4 kB 7.1 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.0.0 pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [3]:
import pandas as pd
import numpy as np


## Reading Data from a CSV File

Pandas provides the `read_csv` function to read data from CSV files. Here is an example:

In [4]:
# Assuming there's a CSV file named 'example.csv' in the current directory
csv_data = pd.read_csv('data/titanic.csv')


## Reading Data from an Excel File

To read data from Excel files, we use the `read_excel` function. Here's how you can do it:

In [5]:
# Assuming there's an Excel file named 'example.xlsx' in the current directory
excel_data = pd.read_excel('data/titanic.xlsx', sheet_name='titanic')

x
## Viewing the Dataset

Next, let's view the first few rows of the dataset to understand its structure.

In [11]:
# We're now viewing the first 10 rows of the dataframe. The default value of the .head() function is 5.
excel_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# You could also view the last rows using .tail() function.
excel_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q


## Basic Statistics

We can get a basic statistical overview of the dataset using the `describe()` function. Note that this function will provide info on numerical data, not categorical data.
In its basic form, the `describe()` function will provide the following stats;
* Count - count of non-empty values in the column
* Mean  - mean of the column
* std   - standard deviation of the column
* min   - minimum value in the column
* max   - maximum value in the column
* 25%   - first quartile of the column
* 50%   - second quartile of the column
* 75%   - third quirtile of the column

In [7]:
# You can also specify specific percentile points using the parameter 'percentile'. 
csv_data.describe(percentiles=[.1, .25, .5, .75, .9])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
10%,90.000000,0.000000,1.000000,14.000000,0.000000,0.000000,7.550000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
90%,802.000000,1.000000,3.000000,50.000000,1.000000,2.000000,77.958300
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Dataframe's information

We can get useful information on the dataframe using the `info()` function. E.g. index length, number of non-null values per column, column name, column's data type.
You can also get the total number of columns of each type and the size of the dataframe in the memory.

In [12]:
csv_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Finding unique values

We can find all unique value in a column using `unique()` function.

In [30]:
csv_data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [31]:
csv_data['Parch'].unique()

array([0, 1, 2, 5, 3, 4, 6], dtype=int64)

## nunique() - Counting Unique Values

In [ ]:
['Embarked'].nunique()

## Counting unique values

We can count the number of occurances of each unique value in a column using `value_counts()` function.

In [32]:
csv_data['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [10]:
csv_data['Parch'].value_counts()

Parch
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: count, dtype: int64

## Counting empty "Null" values

We can find null values using `isnull()` function. We will also add `sum()` to count them per column.

In [23]:
csv_data.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [22]:
# 'print()' function is used here for convenience. You can ignore it for now.
csv_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
# We can add another 'sum()' to get the total count of null values across the dataframe.
csv_data.isnull().sum().sum()

np.int64(866)

## Grouping values

We can also group categorical (and other) values using the `groupby()` function. You will also need an arithmatic function to get the full utility out of the function.

In [32]:
csv_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
# For this example, we can sum the total value in a column per group of another column.
csv_data.groupby('Pclass')['Survived'].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [16]:
# Note that we can also perform other operations such as average, max, min, etc. 
csv_data.groupby('Pclass')['Fare'].min()

Pclass
1    0.0
2    0.0
3    0.0
Name: Fare, dtype: float64

In [13]:
csv_data.groupby('Pclass')['Fare'].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

In [14]:
csv_data.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [33]:
# Or you could get them all at once using the 'agg' function.
csv_data.groupby('Pclass')['Fare'].agg(['sum', 'mean', 'min', 'max', 'std', 'count'])

               sum       mean  min       max        std  count
Pclass
1       18177.4125  84.154687  0.0  512.3292  78.380373    216
2        3801.8417  20.662183  0.0   73.5000  13.417399    184
3        6714.6951  13.675550  0.0   69.5500  11.778142    491

## Sorting

We can also sort the grouped values using the `sort_values()` function.
We will also learn how to create a variable that stores the data we want to save. It's as easy as typing '='.

In [40]:
# We will create a variable named 'grouped_data' using '=' operator.
grouped_data = csv_data.groupby('Pclass')['Fare'].agg(['sum', 'mean', 'min', 'max', 'std', 'count'])

# Now we will sort the dataframe by count.
grouped_data.sort_values(by=['count', 'max'], ascending=True)

               sum       mean  min       max        std  count
Pclass
2        3801.8417  20.662183  0.0   73.5000  13.417399    184
1       18177.4125  84.154687  0.0  512.3292  78.380373    216
3        6714.6951  13.675550  0.0   69.5500  11.778142    491

## Slicing DataFrame Rows

In [ ]:
csv_data[10:20]

## loc[] - Label-based Indexing

In [ ]:
csv_data.loc[csv_data['Age'] > 50, ['Name', 'Age']]

## iloc[] - Position-based Indexing

In [1]:
csv_data.iloc[10:20, 1:3]

NameError: name 'titanic_data' is not defined

## Filtering with Multiple Conditions

In [2]:
csv_data[(csv_data['Age'] > 30) & (csv_data['Pclass'] == 1)]

NameError: name 'titanic_data' is not defined